//=============================================================================
//
// ゲーム画面処理 [game.cpp]
// Author : 
//
//=============================================================================
#include "game.h"

#include "background.h"
#include "bullet.h"
#include "camera.h"
#include "effect.h"
#include "explosion.h"
#include "item.h"
#include "life.h"
#include "light.h"
#include "player.h"
#include "score.h"
#include "shadow.h"
#include "sound.h"
#include "timer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitGame(void)
{
	// ライトの初期化
	InitLight();

	// 影の初期化
	//InitShadow();

	// プレイヤーの初期化
	InitPlayer();

	// 背景の初期化
	InitBackground();

	// タイマーの初期化
	InitTimer();
	ResetTimer(30);

	// スコアの初期化
	InitScore();

	// BGM再生
	PlaySound(SOUND_LABEL_BGM000);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitGame(void)
{
	// ライトの終了処理
	UninitLight();

	// プレイヤーの終了処理
	UninitPlayer();

	// 背景の終了処理
	UninitBackground();

	// タイマーの終了処理
	UninitTimer();

	// スコアの終了処理
	UninitScore();

	// BGM停止
	PlaySound(SOUND_LABEL_BGM000);
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateGame(void)
{
	// 背景処理の更新
	UpdateBackground();

	// プレイヤー処理の更新
	UpdatePlayer();

	// ライフ処理の更新
	UpdateLife();

	// タイマー処理の更新
	UpdateTimer();

	// スコア処理の更新
	UpdateScore();
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawGame(void)
{
	// カメラの設定
	SetCamera();

	// 背景の描画
	DrawBackground();

	// プレイヤー処理の描画
	DrawPlayer();

	// ライフ処理の描画
	DrawLife();

	// タイマー処理の描画
	DrawTimer();

	// スコア処理の描画
	DrawScore();
}

