//=============================================================================
//
// ゲーム画面処理 [game.cpp]
// Author : 
//
//=============================================================================
#include "game.h"

#include "background.h"
#include "bullet.h"
#include "camera.h"
#include "effect.h"
#include "explosion.h"
#include "item.h"
#include "life.h"
#include "light.h"
#include "player.h"
#include "score.h"
#include "shadow.h"
#include "sound.h"
#include "timer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitGame(void)
{
	// ライトの初期化
	InitLight();

	// カメラの初期化
	InitCamera();

	// 影の初期化
	//InitShadow();

	// プレイヤーの初期化
	InitPlayer();

	// 背景の初期化
	InitBackground();

	// 弾の初期化
	//InitBullet();

	// 爆発の初期化
	//InitExplosion();

	// エフェクトの初期化
	//InitEffect();

	// ライフの初期化
	//InitLife();

	// タイマーの初期化
	InitTimer();
	ResetTimer(30);

	// スコアの初期化
	InitScore();

	// BGM再生
	PlaySound(SOUND_LABEL_BGM000);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitGame(void)
{
	// ライトの終了処理
	UninitLight();

	// カメラの終了処理
	UninitCamera();

	// 影の終了処理
	//UninitShadow();

	// プレイヤーの終了処理
	UninitPlayer();

	// 背景の終了処理
	UninitBackground();

	// 弾の終了処理
	//UninitBullet();

	// 爆発の終了処理
	//UninitExplosion();

	// エフェトの終了処理
	//UninitEffect();

	// ライフの終了処理
	//UninitLife();

	// タイマーの終了処理
	UninitTimer();

	// スコアの終了処理
	UninitScore();

	// BGM停止
	PlaySound(SOUND_LABEL_BGM000);
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateGame(void)
{
	// カメラ更新
	//UpdateCamera();

	// 影処理の更新
	//UpdateShadow();

	// 背景処理の更新
	UpdateBackground();

	// プレイヤー処理の更新
	UpdatePlayer();

	// 弾処理の更新
	//UpdateBullet();

	// 爆発処理の更新
	//UpdateExplosion();

	// エフェクト処理の更新
	//UpdateEffect();

	// ライフ処理の更新
	UpdateLife();

	// タイマー処理の更新
	UpdateTimer();

	// スコア処理の更新
	UpdateScore();
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawGame(void)
{
	// カメラの設定
	SetCamera();

	// 背景の描画
	DrawBackground();

	//// 影処理の描画
	//DrawShadow();

	// プレイヤー処理の描画
	DrawPlayer();

	//// 弾処理の描画
	//DrawBullet();

	//// 壁処理の描画
	//DrawMeshWall();

	//// 爆発処理の描画
	//DrawExplosion();

	//// エフェクト処理の描画
	//DrawEffect();

	// ライフ処理の描画
	DrawLife();

	// タイマー処理の描画
	DrawTimer();

	// スコア処理の描画
	DrawScore();
}

